app/controllers/applicants_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO `users` (`user_id`, `password_digest`, `created_at`, `updated_at`) VALUES ('fuquan', '$2a$10$38JPXRNMI3vGVMdvqgdYp.sdjZEV5Rh0CXRtSfRj4imy0TuFOfTd6', '2017-03-29 02:57:32', '2017-03-29 02:57:32')