app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`user_id` = 'fu' LIMIT 1
SELECT `wikis`.* FROM `wikis`
---
  def create
    user = User.find_by(user_id: user_params[:user_id]).try(:authenticate, user_params[:password])
    if user
      session[:user_id] = user.user_id
      # render plain: sprintf("welcome, %s!", session[:user_id])
      @wikis = Wiki.all