app/controllers/wikis_controller.rb

SELECT `wikis`.* FROM `wikis`
SELECT  `wikis`.* FROM `wikis` WHERE `wikis`.`user_id` = 'fuquan' LIMIT 1
SELECT `wikis`.* FROM `wikis` WHERE `wikis`.`tag` = 'fuquan'
---
  def index
    # puts params[:user_id]
    if params[:user_id] == nil && params[:tag] == nil
      @wikis = Wiki.all
      # puts @wikis
      # @wikis = Wiki.find_by!(user_id: 'fuquan')
    elsif params[:user_id] != nil
      @wikis = Wiki.where(user_id: params[:user_id])
      # puts @wikis
    elsif params[:tag] != nil
             @wikis = Wiki.where(tag: params[:tag])

INSERT INTO `wikis` (`tag`, `info`, `title`, `user_id`, `created_at`, `updated_at`) VALUES ('d', 'd', 'd', 'd', '2017-03-28 15:38:41', '2017-03-28 15:38:41')
---
  def create
    @wiki = Wiki.new(wiki_params)

    respond_to do |format|
      if @wiki.save

SELECT  `wikis`.* FROM `wikis` WHERE `wikis`.`id` = 5 LIMIT 1
---
  def showTag
      @wiki = Wiki.find(params[:wiki_id])

SELECT  `wikis`.* FROM `wikis` WHERE `wikis`.`id` = 5 LIMIT 1
---
  def showUser
    @wiki = Wiki.find(params[:wiki_id])

UPDATE `wikis` SET `title` = 'dedd', `user_id` = 'fuquan', `updated_at` = '2017-04-01 02:35:04' WHERE `wikis`.`id` = 16
---
  def update
    # @hh= wiki_params[:user_id]
    # @jj= session[:user_id]
    if session[:user_id].present? && session[:user_id] == wiki_params[:user_id]
      respond_to do |format|
        if @wiki.update(wiki_params)

DELETE FROM `wikis` WHERE `wikis`.`id` = 3
---
  def destroy
    @wiki.destroy

SELECT  `wikis`.* FROM `wikis` WHERE `wikis`.`id` = 3 LIMIT 1
---
    def set_wiki
      @wiki = Wiki.find(params[:id])